"""
Дана строка, состоящая из слов, разделенных пробелами.
 Напишите программу, которая подсчитывает количество слов в этой строке.
"""

line = input().split()
length_line = len(line)
print(length_line)